; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph5 - mode
	thermograph3 - mode
	infrared2 - mode
	thermograph1 - mode
	infrared4 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star4 - direction
	Star7 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite1 Star3)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 spectrograph5)
	(have_image Star10 spectrograph5)
	(have_image Star10 thermograph3)
	(have_image Planet11 thermograph0)
	(have_image Star12 thermograph3)
	(have_image Planet13 infrared4)
	(have_image Planet13 thermograph3)
))

)

; plan
1. (turn_to satellite2 star2 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star2)
   goals met: 0 of 11
2. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 0 of 11
3. (turn_to satellite0 star2 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star2)
   goals met: 0 of 11
4. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 11
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
7. (calibrate satellite2 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 11
8. (calibrate satellite1 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 0 of 11
9. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 11
10. (turn_to satellite0 planet13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet13)
   goals met: 0 of 11
11. (take_image satellite0 planet13 instrument0 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 1 of 11
12. (turn_to satellite0 planet9 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet9)
   goals met: 1 of 11
13. (take_image satellite0 planet9 instrument0 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 2 of 11
14. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 2 of 11
15. (take_image satellite0 star10 instrument0 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 3 of 11
16. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 4 of 11
17. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 4 of 11
18. (take_image satellite0 star12 instrument0 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 5 of 11
19. (turn_to satellite0 phenomenon8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 11
20. (take_image satellite0 phenomenon8 instrument0 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 7 of 11
21. (turn_to satellite1 planet13 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet13)
   goals met: 7 of 11
22. (take_image satellite1 planet13 instrument1 infrared4)
   added: (have_image planet13 infrared4)
   goals met: 8 of 11
23. (turn_to satellite1 star3 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star3)
   goals met: 9 of 11
24. (turn_to satellite2 phenomenon8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon8)
   goals met: 9 of 11
25. (take_image satellite2 phenomenon8 instrument2 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 10 of 11
26. (turn_to satellite2 planet11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet11)
   goals met: 10 of 11
27. (take_image satellite2 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 11 of 11
